Documents/ВнесудебноеБанкротствоДолжника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВнесудебноеБанкротствоДолжника</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспространитьНаВсеСделки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Публикации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСобытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОбновленияСтадииПроцедуры</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтадияПроцедуры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>URLПубликацииОбновленияСтадииПроцедуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПубликацииПризнакаНеправомерныхДействий</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПубликацииПризнакаПреднамеренногоИлиФиктивногоБанкротства</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗавершенияРасчетовСКредиторами</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОсвобожденияОтИсполненияТребованийКредиторов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВосстановленияОбязательства</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеСведения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗафиксированоВКИ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КредитныеИсторииДанныеСделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КредитныеИсторииДанныеСделки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>UID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>38</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыходаНаПросрочку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПередачиФинансирования</Name>
					<Comment>Обычно совпадает с датой начала договора, но может быть датой РКО</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРасчетаСрочнойЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРасчетаПросроченнойЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСделки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СолидарныйДоговор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорМКЗ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорМикрозайма</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеструктуризацияМКЗ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеструктуризацияМикрозайма</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обеспечительство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Обеспечительства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СудебноеДело</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрекращениеОбязательства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеденежноеОбязательство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НеденежныеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Просрочка90плюс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакПотребительскогоКредита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНБКИВидКредита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНБКИТипКредита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНБКИЦельКредита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прощение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СведенияОбИзмененииДоговора</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Банкротство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ДелоОБанкротстве</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнесудебноеБанкротствоДолжника</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезнадежныйДолг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЗаимодавца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастичноеПравопреемство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакКредитнойЛинии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНБКИТипКредититнойЛинии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакПлавающейПроцентнойСтавки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВозникновенияОбязательстваСубъекта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядковыйНомерТранша</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентнаяСтавкаПоУсловиям</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастичнаяПродажа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UIDРефинансированнойСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>38</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяПроцентнаяСтавкаПоУсловиям</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакПредусмотренногоГрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КредитныеИсторииСобытияСделки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументСобытие</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВнесудебноеБанкротствоДолжника/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;   
	
	СобытиеЗафиксировано = КредитныеИстории.СобытиеСубъектаЗафиксированоИсточником(ЭтотОбъект.Субъект, ЭтотОбъект.Ссылка, "1.12");
	Если Не СобытиеЗафиксировано Тогда 
		Для Каждого Стр ИЗ Публикации Цикл
			Если НЕ Стр.ЗафиксированоВКИ Тогда
				КредитныеИстории.ЗаписатьСобытиеСубъекта(ЭтотОбъект.Субъект, Стр.ДатаСобытия, ЭтотОбъект.Ссылка, "1.12");
			КонецЕсли;	
		КонецЦикла;  
	КонецЕсли; 
	
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Сделка
	|ПОМЕСТИТЬ ДОДолжника
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.Должник = &Должник
	|	И НЕ ДолговыеОбязательства.ПометкаУдаления
	//|	И ДолговыеОбязательства.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(КредитныеИсторииДанныеСделки.ДатаСобытия) КАК ДатаСобытия,
	|	ДОДолжника.Сделка КАК Сделка
	|ИЗ
	|	ДОДолжника КАК ДОДолжника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КредитныеИсторииДанныеСделки КАК КредитныеИсторииДанныеСделки
	|		ПО ДОДолжника.Сделка = КредитныеИсторииДанныеСделки.Сделка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДОДолжника.Сделка" ;
	
	
	
	Если НЕ РаспространитьНаВсеСделки И ЗначениеЗаполнено(Сделка) Тогда 
		  Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ ДолговыеОбязательства.ПометкаУдаления", "И НЕ ДолговыеОбязательства.ПометкаУдаления" + " И ДолговыеОбязательства.Ссылка = &Ссылка");
		  Запрос.УстановитьПараметр("Ссылка", Сделка);
	КонецЕсли;	
	  
	Запрос.УстановитьПараметр("Должник", Субъект);
	Результат = Запрос.Выполнить().Выбрать();
		
	Пока Результат.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.КредитныеИсторииДанныеСделки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сделка.Установить(Результат.Сделка); 
		НаборЗаписей.Отбор.ДатаСобытия.Установить(Результат.ДатаСобытия);
		НаборЗаписей.Прочитать(); 
		
		Для Каждого Запись ИЗ НаборЗаписей Цикл
			Запись.Банкротство = Ссылка;
		КонецЦикла;
		
		НаборЗаписей.Записать();
	КонецЦикла;	
		
	
КонецПроцедуры   

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	СобытиеЗафиксировано = КредитныеИстории.СобытиеСубъектаЗафиксированоИсточником(ЭтотОбъект.Субъект, ЭтотОбъект.Ссылка, "1.12"); 
	Если СобытиеЗафиксировано Тогда 
		КредитныеИстории.УдалитьСобытияИсточникаСубъекта(ЭтотОбъект.Субъект, ЭтотОбъект.Ссылка);  
	КонецЕсли; 
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Сделка
	|ПОМЕСТИТЬ ДОДолжника
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.Должник = &Должник
	|	И НЕ ДолговыеОбязательства.ПометкаУдаления
	//|	И ДолговыеОбязательства.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(КредитныеИсторииДанныеСделки.ДатаСобытия) КАК ДатаСобытия,
	|	ДОДолжника.Сделка КАК Сделка
	|ИЗ
	|	ДОДолжника КАК ДОДолжника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КредитныеИсторииДанныеСделки КАК КредитныеИсторииДанныеСделки
	|		ПО ДОДолжника.Сделка = КредитныеИсторииДанныеСделки.Сделка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДОДолжника.Сделка" ;
		
	
	Если НЕ РаспространитьНаВсеСделки И ЗначениеЗаполнено(Сделка) Тогда 
		  Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ ДолговыеОбязательства.ПометкаУдаления", "И НЕ ДолговыеОбязательства.ПометкаУдаления " + "И ДолговыеОбязательства.Ссылка = &Ссылка");
		  Запрос.УстановитьПараметр("Ссылка", Сделка);
	КонецЕсли;	
	  
	Запрос.УстановитьПараметр("Должник", Субъект);
	Результат = Запрос.Выполнить().Выбрать();
		
	Пока Результат.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.КредитныеИсторииДанныеСделки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сделка.Установить(Результат.Сделка); 
		НаборЗаписей.Отбор.ДатаСобытия.Установить(Результат.ДатаСобытия);
		НаборЗаписей.Прочитать(); 
		
		Для Каждого Запись ИЗ НаборЗаписей Цикл
			Запись.Банкротство = "0";
		КонецЦикла;
		
		НаборЗаписей.Записать();

	КонецЦикла;	
	
КонецПроцедуры
